RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/MIMXRT1060/MIMXRT1060/drivers/fsl_clock.h
    kCLOCK_CsiMux = CCM_TUPLE(CSCDR3_OFFSET,
                              CCM_CSCDR3_CSI_CLK_SEL_SHIFT,
                              CCM_CSCDR3_CSI_CLK_SEL_MASK,
                              CCM_NO_BUSY_WAIT), /*!< csi mux name */
} clock_mux_t;

/*!
 * @brief Clock divider value.
 */
typedef enum _clock_div_value
{
    kCLOCK_ArmDivBy1 = 0, /*!< ARM clock divider set to divided by 1. */
    kCLOCK_ArmDivBy2 = 1, /*!< ARM clock divider set to divided by 2. */
    kCLOCK_ArmDivBy3 = 2, /*!< ARM clock divider set to divided by 3. */
    kCLOCK_ArmDivBy4 = 3, /*!< ARM clock divider set to divided by 4. */
    kCLOCK_ArmDivBy5 = 4, /*!< ARM clock divider set to divided by 5. */
    kCLOCK_ArmDivBy6 = 5, /*!< ARM clock divider set to divided by 6. */
    kCLOCK_ArmDivBy7 = 6, /*!< ARM clock divider set to divided by 7. */
    kCLOCK_ArmDivBy8 = 7, /*!< ARM clock divider set to divided by 8. */

    kCLOCK_PeriphClk2DivBy1 = 0, /*!< PeriphClk2 divider set to divided by 1. */
    kCLOCK_PeriphClk2DivBy2 = 1, /*!< PeriphClk2 divider set to divided by 2. */
    kCLOCK_PeriphClk2DivBy3 = 2, /*!< PeriphClk2 divider set to divided by 3. */
    kCLOCK_PeriphClk2DivBy4 = 3, /*!< PeriphClk2 divider set to divided by 4. */
    kCLOCK_PeriphClk2DivBy5 = 4, /*!< PeriphClk2 divider set to divided by 5. */
    kCLOCK_PeriphClk2DivBy6 = 5, /*!< PeriphClk2 divider set to divided by 6. */
    kCLOCK_PeriphClk2DivBy7 = 6, /*!< PeriphClk2 divider set to divided by 7. */
    kCLOCK_PeriphClk2DivBy8 = 7, /*!< PeriphClk2 divider set to divided by 8. */

    kCLOCK_SemcDivBy1 = 0, /*!< SEMC clock divider set to divided by 1. */
    kCLOCK_SemcDivBy2 = 1, /*!< SEMC clock divider set to divided by 2. */
    kCLOCK_SemcDivBy3 = 2, /*!< SEMC clock divider set to divided by 3. */
    kCLOCK_SemcDivBy4 = 3, /*!< SEMC clock divider set to divided by 4. */
    kCLOCK_SemcDivBy5 = 4, /*!< SEMC clock divider set to divided by 5. */
    kCLOCK_SemcDivBy6 = 5, /*!< SEMC clock divider set to divided by 6. */
    kCLOCK_SemcDivBy7 = 6, /*!< SEMC clock divider set to divided by 7. */
    kCLOCK_SemcDivBy8 = 7, /*!< SEMC clock divider set to divided by 8. */

    kCLOCK_AhbDivBy1 = 0, /*!< AHB clock divider set to divided by 1. */
    kCLOCK_AhbDivBy2 = 1, /*!< AHB clock divider set to divided by 2. */
    kCLOCK_AhbDivBy3 = 2, /*!< AHB clock divider set to divided by 3. */
    kCLOCK_AhbDivBy4 = 3, /*!< AHB clock divider set to divided by 4. */
    kCLOCK_AhbDivBy5 = 4, /*!< AHB clock divider set to divided by 5. */
    kCLOCK_AhbDivBy6 = 5, /*!< AHB clock divider set to divided by 6. */
    kCLOCK_AhbDivBy7 = 6, /*!< AHB clock divider set to divided by 7. */
    kCLOCK_AhbDivBy8 = 7, /*!< AHB clock divider set to divided by 8. */

    kCLOCK_IpgDivBy1 = 0, /*!< IPG clock divider set to divided by 1. */
    kCLOCK_IpgDivBy2 = 1, /*!< IPG clock divider set to divided by 2. */
    kCLOCK_IpgDivBy3 = 2, /*!< IPG clock divider set to divided by 3. */
    kCLOCK_IpgDivBy4 = 3, /*!< IPG clock divider set to divided by 4. */

    kCLOCK_Flexspi2DivBy1 = 0, /*!< Flexspi2 divider set to divided by 1. */
    kCLOCK_Flexspi2DivBy2 = 1, /*!< Flexspi2 divider set to divided by 2. */
    kCLOCK_Flexspi2DivBy3 = 2, /*!< Flexspi2 divider set to divided by 3. */
    kCLOCK_Flexspi2DivBy4 = 3, /*!< Flexspi2 divider set to divided by 4. */
    kCLOCK_Flexspi2DivBy5 = 4, /*!< Flexspi2 divider set to divided by 5. */
    kCLOCK_Flexspi2DivBy6 = 5, /*!< Flexspi2 divider set to divided by 6. */
    kCLOCK_Flexspi2DivBy7 = 6, /*!< Flexspi2 divider set to divided by 7. */
    kCLOCK_Flexspi2DivBy8 = 7, /*!< Flexspi2 divider set to divided by 8. */

    kCLOCK_LpspiDivBy1 = 0, /*!< Lpspi divider set to divided by 1. */
    kCLOCK_LpspiDivBy2 = 1, /*!< Lpspi divider set to divided by 2. */
    kCLOCK_LpspiDivBy3 = 2, /*!< Lpspi divider set to divided by 3. */
    kCLOCK_LpspiDivBy4 = 3, /*!< Lpspi divider set to divided by 4. */
    kCLOCK_LpspiDivBy5 = 4, /*!< Lpspi divider set to divided by 5. */
    kCLOCK_LpspiDivBy6 = 5, /*!< Lpspi divider set to divided by 6. */
    kCLOCK_LpspiDivBy7 = 6, /*!< Lpspi divider set to divided by 7. */
    kCLOCK_LpspiDivBy8 = 7, /*!< Lpspi divider set to divided by 8. */

    kCLOCK_LcdifDivBy1 = 0, /*!< Lcdif divider set to divided by 1. */
    kCLOCK_LcdifDivBy2 = 1, /*!< Lcdif divider set to divided by 2. */
    kCLOCK_LcdifDivBy3 = 2, /*!< Lcdif divider set to divided by 3. */
    kCLOCK_LcdifDivBy4 = 3, /*!< Lcdif divider set to divided by 4. */
    kCLOCK_LcdifDivBy5 = 4, /*!< Lcdif divider set to divided by 5. */
    kCLOCK_LcdifDivBy6 = 5, /*!< Lcdif divider set to divided by 6. */
    kCLOCK_LcdifDivBy7 = 6, /*!< Lcdif divider set to divided by 7. */
    kCLOCK_LcdifDivBy8 = 7, /*!< Lcdif divider set to divided by 8. */

    kCLOCK_FlexspiDivBy1 = 0, /*!< Flexspi divider set to divided by 1. */
    kCLOCK_FlexspiDivBy2 = 1, /*!< Flexspi divider set to divided by 2. */
    kCLOCK_FlexspiDivBy3 = 2, /*!< Flexspi divider set to divided by 3. */
    kCLOCK_FlexspiDivBy4 = 3, /*!< Flexspi divider set to divided by 4. */
    kCLOCK_FlexspiDivBy5 = 4, /*!< Flexspi divider set to divided by 5. */
    kCLOCK_FlexspiDivBy6 = 5, /*!< Flexspi divider set to divided by 6. */
    kCLOCK_FlexspiDivBy7 = 6, /*!< Flexspi divider set to divided by 7. */
    kCLOCK_FlexspiDivBy8 = 7, /*!< Flexspi divider set to divided by 8. */

    kCLOCK_TraceDivBy1 = 0, /*!< Trace divider set to divided by 1. */
    kCLOCK_TraceDivBy2 = 1, /*!< Trace divider set to divided by 2. */
    kCLOCK_TraceDivBy3 = 2, /*!< Trace divider set to divided by 3. */
    kCLOCK_TraceDivBy4 = 3, /*!< Trace divider set to divided by 4. */

    kCLOCK_Usdhc2DivBy1 = 0, /*!< Usdhc2 divider set to divided by 1. */
    kCLOCK_Usdhc2DivBy2 = 1, /*!< Usdhc2 divider set to divided by 2. */
    kCLOCK_Usdhc2DivBy3 = 2, /*!< Usdhc2 divider set to divided by 3. */
    kCLOCK_Usdhc2DivBy4 = 3, /*!< Usdhc2 divider set to divided by 4. */
    kCLOCK_Usdhc2DivBy5 = 4, /*!< Usdhc2 divider set to divided by 5. */
    kCLOCK_Usdhc2DivBy6 = 5, /*!< Usdhc2 divider set to divided by 6. */
    kCLOCK_Usdhc2DivBy7 = 6, /*!< Usdhc2 divider set to divided by 7. */
    kCLOCK_Usdhc2DivBy8 = 7, /*!< Usdhc2 divider set to divided by 8. */

    kCLOCK_Usdhc1DivBy1 = 0, /*!< Usdhc1 divider set to divided by 1. */
    kCLOCK_Usdhc1DivBy2 = 1, /*!< Usdhc1 divider set to divided by 2. */
    kCLOCK_Usdhc1DivBy3 = 2, /*!< Usdhc1 divider set to divided by 3. */
    kCLOCK_Usdhc1DivBy4 = 3, /*!< Usdhc1 divider set to divided by 4. */
    kCLOCK_Usdhc1DivBy5 = 4, /*!< Usdhc1 divider set to divided by 5. */
    kCLOCK_Usdhc1DivBy6 = 5, /*!< Usdhc1 divider set to divided by 6. */
    kCLOCK_Usdhc1DivBy7 = 6, /*!< Usdhc1 divider set to divided by 7. */
    kCLOCK_Usdhc1DivBy8 = 7, /*!< Usdhc1 divider set to divided by 8. */

    kCLOCK_Flexio2DivBy1 = 0, /*!< Flexio2 divider set to divided by 1. */
    kCLOCK_Flexio2DivBy2 = 1, /*!< Flexio2 divider set to divided by 2. */
    kCLOCK_Flexio2DivBy3 = 2, /*!< Flexio2 divider set to divided by 3. */
    kCLOCK_Flexio2DivBy4 = 3, /*!< Flexio2 divider set to divided by 4. */
    kCLOCK_Flexio2DivBy5 = 4, /*!< Flexio2 divider set to divided by 5. */
    kCLOCK_Flexio2DivBy6 = 5, /*!< Flexio2 divider set to divided by 6. */
    kCLOCK_Flexio2DivBy7 = 6, /*!< Flexio2 divider set to divided by 7. */
    kCLOCK_Flexio2DivBy8 = 7, /*!< Flexio2 divider set to divided by 8. */

    kCLOCK_Sai3PreDivBy1 = 0, /*!< Sai3Pre divider set to divided by 1. */
    kCLOCK_Sai3PreDivBy2 = 1, /*!< Sai3Pre divider set to divided by 2. */
    kCLOCK_Sai3PreDivBy3 = 2, /*!< Sai3Pre divider set to divided by 3. */
    kCLOCK_Sai3PreDivBy4 = 3, /*!< Sai3Pre divider set to divided by 4. */
    kCLOCK_Sai3PreDivBy5 = 4, /*!< Sai3Pre divider set to divided by 5. */
    kCLOCK_Sai3PreDivBy6 = 5, /*!< Sai3Pre divider set to divided by 6. */
    kCLOCK_Sai3PreDivBy7 = 6, /*!< Sai3Pre divider set to divided by 7. */
    kCLOCK_Sai3PreDivBy8 = 7, /*!< Sai3Pre divider set to divided by 8. */

